txt = input('Напишите текст на русском: ').upper()
table_encryption = {'А':11, 'Б':12, 'В':13, 'Г':14, 'Д':15, 'Е/Ё': 16, 
                    'Ж':21, 'З':22, 'И':23, 'Й':24, 'К':25, 'Л': 26,
                    'М':31, 'Н':32, 'О':33, 'П':34, 'Р':35, 'С': 36,
                    'Е':41, 'У':42, 'Ф':43, 'Х':44, 'Ц':45, 'Ч': 46, 
                    'Ш/Щ':51, 'Ы':52, 'Ь/Ъ':53, 'Э':54, 'Ю':55, 'Я': 56,}

table_decryption = {11: 'А', 12: 'Б', 13: 'В', 14: 'Г', 15: 'Д', 16: 'Е/Ё',
                    21: 'Ж', 22: 'З', 23: 'И', 24: 'Й', 25: 'К', 26: 'Л',
                    31: 'М', 32: 'Н', 33: 'О', 34: 'П', 35: 'Р', 36: 'С',
                    41: 'Т', 42: 'У', 43: 'Ф', 44: 'Х', 45: 'Ц', 46: 'Ч',
                    51: 'Щ/Щ', 52: 'Ы', 53: 'Ь/Ъ', 54: 'Э', 55: 'Ю', 56: 'Я'}



for i in txt:
    print(table_encryption[i], end=' ')
print()

numbers = list(map(int, input('Вводите числа через пробел: ').split()))
for j in numbers:
    print(table_decryption[j], end=' ')
